In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv(r'C:\Users\choco\OneDrive\Desktop\python\Car_sales.csv')
df.head(1)

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14

In [5]:
df.shape

(157, 15)

In [6]:
df.columns

Index(['Manufacturer', 'Model', 'Sales in thousands', '4-year resale value',
       'Vehicle type', 'Price in thousands', 'Engine size', 'Horsepower',
       'Wheelbase', 'Width', 'Length', 'Curb weight', 'Fuel capacity',
       'Fuel efficiency', 'Latest Launch'],
      dtype='object')

In [7]:
df.isnull().sum()

Manufacturer           0
Model                  0
Sales in thousands     0
4-year resale value    0
Vehicle type           0
Price in thousands     0
Engine size            0
Horsepower             0
Wheelbase              0
Width                  0
Length                 0
Curb weight            0
Fuel capacity          0
Fuel efficiency        0
Latest Launch          0
dtype: int64

In [8]:
df.describe()

       Sales in thousands
count          157.000000
mean            52.998076
std             68.029422
min              0.110000
25%             14.114000
50%             29.450000
75%             67.956000
max            540.561000

In [9]:
#total sales by manufacturer
df['Manufacturer'].value_counts()

Manufacturer
Ford             11
Dodge            11
Chevrolet         9
Mercedes-Benz     9
Toyota            9
Chrysler          7
Mitsubishi        7
Nissan            7
Mercury           6
Oldsmobile        6
Lexus             6
Pontiac           6
Volvo             6
Volkswagen        6
Cadillac          5
Honda             5
Saturn            5
Plymouth          4
Buick             4
Acura             4
Audi              3
BMW               3
Lincoln           3
Porsche           3
Jeep              3
Hyundai           3
Saab              2
Subaru            2
Jaguar            1
Infiniti          1
Name: count, dtype: int64

In [10]:
#total sales by manufacturer
total_sales=df.groupby('Manufacturer')['Sales in thousands'].sum()
total_sales

Manufacturer
Acura              79.005
Audi               40.557
BMW                46.505
Buick             242.019
Cadillac          112.178
Chevrolet         554.365
Chrysler          201.721
Dodge             910.149
Ford             2022.635
Honda             592.674
Hyundai           137.326
Infiniti           23.713
Jaguar             15.467
Jeep              293.153
Lexus             106.843
Lincoln            85.634
Mercedes-Benz     117.125
Mercury           237.999
Mitsubishi        180.895
Nissan            399.635
Oldsmobile        178.989
Plymouth           64.001
Pontiac           370.534
Porsche            12.128
Saab               21.306
Saturn            168.850
Subaru             80.135
Toyota            740.205
Volkswagen        209.212
Volvo              75.740
Name: Sales in thousands, dtype: float64

In [12]:
#Extract the details of all manufacturer except Mitsubishi  
et=df[df['Manufacturer'] !='Mitsubishi'] 
et

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14
1,Acura,TL,39.384,19.875,Passenger,28.4,3.2,225,108.1,70.3,192.9,3.517,17.2,25,6-Mar-15
2,Acura,CL,14.114,18.225,Passenger,.,3.2,225,106.9,70.6,192,3.47,17.2,26,1-Apr-14
3,Acura,RL,8.588,29.725,Passenger,42,3.5,210,114.6,71.4,196.6,3.85,18,22,3-Oct-15
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150,102.6,68.2,178,2.998,16.4,27,10-Aug-15
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,.,Passenger,24.4,1.9,160,100.5,67.6,176.6,3.042,15.8,25,21-Sep-15
153,Volvo,S70,15.245,.,Passenger,27.5,2.4,168,104.9,69.3,185.9,3.208,17.9,25,24-Nov-14
154,Volvo,V70,17.531,.,Passenger,28.8,2.4,168,104.9,69.3,186.2,3.259,17.9,25,25-Jun-15
155,Volvo,C70,3.493,.,Passenger,45.5,2.3,236,104.9,71.5,185.7,3.601,18.5,23,26-Apr-15
156,Volvo,S80,18.969,.,Passenger,36,2.9,201,109.9,72.1,189.8,3.6,21.1,24,14-Nov-15

In [15]:
df.dtypes

Manufacturer            object
Model                   object
Sales in thousands     float64
4-year resale value     object
Vehicle type            object
Price in thousands      object
Engine size             object
Horsepower              object
Wheelbase               object
Width                   object
Length                  object
Curb weight             object
Fuel capacity           object
Fuel efficiency         object
Latest Launch           object
dtype: object

In [16]:
df['4-year resale value'].replace(',','',regex=True,inplace=True)

C:\Users\choco\AppData\Local\Temp\ipykernel_23116\2916887072.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['4-year resale value'].replace(',','',regex=True,inplace=True)

In [17]:
df['4-year resale value'].dtype

dtype('O')

In [19]:
df['4-year resale value'].isnull().sum()
#counts the number of null values present

np.int64(0)

In [20]:
#errors='coerce' parameter in pd.to_numeric() converts to non-numeric values or invalid data to NaN(Not a number).this is useful when data might contain missing values,incorrect entries,or unexpected characters(now by using this method empty string becomes NaN value)
df['4-year resale value']=pd.to_numeric(df['4-year resale value'],errors='coerce')
df['4-year resale value'].isnull().sum()

np.int64(36)

In [21]:
df['4-year resale value'].mean()

np.float64(18.07297520661157)

In [22]:
#to avoid null values mean,median,mode values can be used by using fillna method
df['4-year resale value'].fillna(df['4-year resale value'].mean(),inplace=True)
df['4-year resale value'].isnull().sum()

C:\Users\choco\AppData\Local\Temp\ipykernel_23116\4057351040.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['4-year resale value'].fillna(df['4-year resale value'].mean(),inplace=True)

np.int64(0)

In [23]:
df['4-year resale value'].dtype

dtype('float64')

In [25]:
#Averge resale value by vehicle type
#determine the avg 4 year RESALE value for each type of vehicle
avg_resale_value = df.groupby('Vehicle type')['4-year resale value'].mean()
avg_resale_value

Vehicle type
Car          16.774091
Passenger    18.532064
Name: 4-year resale value, dtype: float64

In [26]:
#maximum horsepower by manufacturer

In [27]:
df.describe

<bound method NDFrame.describe of       Manufacturer              Model  Sales in thousands  \
0    Acura          Integra                        16.919
1    Acura          TL                             39.384
2    Acura          CL                             14.114
3    Acura          RL                              8.588
4    Audi           A4                             20.397
..             ...                ...                 ...
152  Volvo          V40                             3.545
153  Volvo          S70                            15.245
154  Volvo          V70                            17.531
155  Volvo          C70                             3.493
156  Volvo          S80                            18.969

     4-year resale value Vehicle type Price in thousands Engine size  \
0              16.360000    Passenger               21.5         1.8
1              19.875000    Passenger               28.4         3.2
2              18.225000    Passenger                  .         3.2
3              29.725000    Passenger                 42         3.5
4              22.255000    Passenger              23.99         1.8
..                   ...          ...                ...         ...
152            18.072975    Passenger               24.4         1.9
153            18.072975    Passenger               27.5         2.4
154            18.072975    Passenger               28.8         2.4
155            18.072975    Passenger               45.5         2.3
156            18.072975    Passenger                 36         2.9

    Horsepower Wheelbase Width Length Curb weight Fuel capacity  \
0          140     101.2  67.3  172.4       2.639          13.2
1          225     108.1  70.3  192.9       3.517          17.2
2          225     106.9  70.6    192        3.47          17.2
3          210     114.6  71.4  196.6        3.85            18
4          150     102.6  68.2    178       2.998          16.4
..         ...       ...   ...    ...         ...           ...
152        160     100.5  67.6  176.6       3.042          15.8
153        168     104.9  69.3  185.9       3.208          17.9
154        168     104.9  69.3  186.2       3.259          17.9
155        236     104.9  71.5  185.7       3.601          18.5
156        201     109.9  72.1  189.8         3.6          21.1

    Fuel efficiency Latest Launch
0                28      2-Feb-14
1                25      6-Mar-15
2                26      1-Apr-14
3                22      3-Oct-15
4                27     10-Aug-15
..              ...           ...
152              25     21-Sep-15
153              25     24-Nov-14
154              25     25-Jun-15
155              23     26-Apr-15
156              24     14-Nov-15

[157 rows x 15 columns]>

In [29]:
df['Horsepower'].dtype

dtype('O')

In [30]:
df['Horsepower']=pd.to_numeric(df['Horsepower'],errors='coerce')
df['Horsepower'].isnull().sum()

np.int64(1)

In [31]:
max_horsepower = df.groupby('Manufacturer')['Horsepower'].max()
max_horsepower

Manufacturer
Acura            225.0
Audi             310.0
BMW              193.0
Buick            240.0
Cadillac         275.0
Chevrolet        345.0
Chrysler         253.0
Dodge            450.0
Ford             240.0
Honda            210.0
Hyundai          148.0
Infiniti         227.0
Jaguar           240.0
Jeep             195.0
Lexus            300.0
Lincoln          300.0
Mercedes-Benz    302.0
Mercury          210.0
Mitsubishi       210.0
Nissan           222.0
Oldsmobile       250.0
Plymouth         253.0
Pontiac          205.0
Porsche          300.0
Saab             185.0
Saturn           137.0
Subaru           165.0
Toyota           230.0
Volkswagen       150.0
Volvo            236.0
Name: Horsepower, dtype: float64

In [32]:
#calculate the  avg fuel efficiency for each manufacturer and vehicle type combination

In [34]:
df['Fuel efficiency']=pd.to_numeric(df['Fuel efficiency'],errors='coerce')
#changes data type of Fuel efficiency to numeric
df['Fuel efficiency'].isnull().sum()

np.int64(3)

In [37]:
df.groupby(['Manufacturer','Vehicle type'])['Fuel efficiency'].mean()

Manufacturer   Vehicle type
Acura          Passenger       25.250000
Audi           Passenger       23.333333
BMW            Passenger       25.000000
Buick          Passenger       24.250000
Cadillac       Car             15.000000
               Passenger       22.000000
Chevrolet      Passenger       28.444444
Chrysler       Car                   NaN
               Passenger       24.500000
Dodge          Car             18.000000
               Passenger       23.250000
Ford           Car             19.400000
               Passenger       25.666667
Honda          Car             22.000000
               Passenger       29.500000
Hyundai        Passenger       27.666667
Infiniti       Passenger       25.000000
Jaguar         Passenger       21.000000
Jeep           Car             18.666667
Lexus          Car             18.000000
               Passenger       22.250000
Lincoln        Car             15.000000
               Passenger       21.500000
Mercedes-Benz  Car             20.000000
               Passenger       23.875000
Mercury        Car             19.500000
               Passenger       25.750000
Mitsubishi     Car             19.000000
               Passenger       24.400000
Nissan         Car             19.000000
               Passenger       26.666667
Oldsmobile     Car             20.500000
               Passenger       24.666667
Plymouth       Car             24.000000
               Passenger       25.666667
Pontiac        Car             23.000000
               Passenger       25.200000
Porsche        Passenger       22.000000
Saab           Passenger       23.000000
Saturn         Passenger       30.400000
Subaru         Car             24.000000
               Passenger       25.000000
Toyota         Car             22.000000
               Passenger       29.250000
Volkswagen     Passenger       26.166667
Volvo          Passenger       24.500000
Name: Fuel efficiency, dtype: float64

In [38]:
#count of cars by manufacturer
df.groupby('Manufacturer')['Model'].count()

Manufacturer
Acura             4
Audi              3
BMW               3
Buick             4
Cadillac          5
Chevrolet         9
Chrysler          7
Dodge            11
Ford             11
Honda             5
Hyundai           3
Infiniti          1
Jaguar            1
Jeep              3
Lexus             6
Lincoln           3
Mercedes-Benz     9
Mercury           6
Mitsubishi        7
Nissan            7
Oldsmobile        6
Plymouth          4
Pontiac           6
Porsche           3
Saab              2
Saturn            5
Subaru            2
Toyota            9
Volkswagen        6
Volvo             6
Name: Model, dtype: int64

In [39]:
#average car price by manufacturer

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Manufacturer         157 non-null    object
 1   Model                157 non-null    object
 2   Sales in thousands   157 non-null    float64
 3   4-year resale value  157 non-null    float64
 4   Vehicle type         157 non-null    object
 5   Price in thousands   157 non-null    object
 6   Engine size          157 non-null    object
 7   Horsepower           156 non-null    float64
 8   Wheelbase            157 non-null    object
 9   Width                157 non-null    object
 10  Length               157 non-null    object
 11  Curb weight          157 non-null    object
 12  Fuel capacity        157 non-null    object
 13  Fuel efficiency      154 non-null    float64
 14  Latest Launch        157 non-null    object
dtypes: float64(4), object(11)
memory usage: 18.5+ KB

In [41]:
df['Price in thousands']=pd.to_numeric(df['Price in thousands'],errors='coerce')
df['Price in thousands'].isnull().sum()

np.int64(2)

In [42]:
df.groupby('Manufacturer')['Price in thousands'].mean()

Manufacturer
Acura            30.633333
Audi             39.980000
BMW              33.096667
Buick            26.781250
Cadillac         40.254000
Chevrolet        20.022778
Chrysler         23.430833
Dodge            24.213636
Ford             21.047273
Honda            20.277000
Hyundai          12.165667
Infiniti         29.465000
Jaguar           42.800000
Jeep             20.991667
Lexus            44.055000
Lincoln          41.690000
Mercedes-Benz    52.916667
Mercury          20.748333
Mitsubishi       22.167429
Nissan           22.360714
Oldsmobile       25.622833
Plymouth         22.642500
Pontiac          22.949167
Porsche          62.473333
Saab             29.610000
Saturn           14.271000
Subaru           21.395000
Toyota           21.982889
Volkswagen       17.698333
Volvo            30.933333
Name: Price in thousands, dtype: float64

In [43]:
#total fuel capacity by vehicle type
df['Fuel capacity']=pd.to_numeric(df['Fuel capacity'],errors='coerce')
df['Fuel capacity'].isnull().sum()

np.int64(1)

In [44]:
df.groupby('Vehicle type')['Fuel capacity'].sum()

Vehicle type
Car           875.8
Passenger    1924.7
Name: Fuel capacity, dtype: float64

In [45]:
#Highest Resale value car for each manufacturer
#Find the model with the highest 4 year resale value for each manufacturer
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Manufacturer         157 non-null    object
 1   Model                157 non-null    object
 2   Sales in thousands   157 non-null    float64
 3   4-year resale value  157 non-null    float64
 4   Vehicle type         157 non-null    object
 5   Price in thousands   155 non-null    float64
 6   Engine size          157 non-null    object
 7   Horsepower           156 non-null    float64
 8   Wheelbase            157 non-null    object
 9   Width                157 non-null    object
 10  Length               157 non-null    object
 11  Curb weight          157 non-null    object
 12  Fuel capacity        156 non-null    float64
 13  Fuel efficiency      154 non-null    float64
 14  Latest Launch        157 non-null    object
dtypes: float64(6), object(9)
memory usage: 18.5+ KB

In [46]:
#idxmax():index return the id correspodent max for 4 year resale value
max_resale_car=df.groupby('Manufacturer')['4-year resale value'].idxmax()
max_resale_car

Manufacturer
Acura              3
Audi               6
BMW                9
Buick             12
Cadillac          15
Chevrolet         24
Chrysler          33
Dodge             39
Ford              54
Honda             61
Hyundai           64
Infiniti          65
Jaguar            66
Jeep              69
Lexus             73
Lincoln           77
Mercedes-Benz     95
Mercury           90
Mitsubishi        83
Nissan           106
Oldsmobile       112
Plymouth         117
Pontiac          123
Porsche          126
Saab             127
Saturn           132
Subaru           134
Toyota           144
Volkswagen       150
Volvo            151
Name: 4-year resale value, dtype: int64

In [47]:
df.loc[max_resale_car,['Manufacturer','Model','4-year resale value']].reset_index()

    index   Manufacturer              Model  4-year resale value
0       3  Acura          RL                           29.725000
1       6  Audi           A8                           39.000000
2       9  BMW            528i                         36.125000
3      12  Buick          Park Avenue                  20.190000
4      15  Cadillac       Seville                      27.100000
5      24  Chevrolet      Corvette                     36.225000
6      33  Chrysler       Town & Country               19.540000
7      39  Dodge          Viper                        58.470000
8      54  Ford           Expedition                   23.575000
9      61  Honda          Odyssey                      19.490000
10     64  Hyundai        Sonata                        8.910000
11     65  Infiniti       I30                          19.690000
12     66  Jaguar         S-Type                       18.072975
13     69  Jeep           Grand Cherokee               18.810000
14     73  Lexus          LS400                        40.375000
15     77  Lincoln        Town car                     21.725000
16     95  Mercedes-Benz  SL-Class                     58.600000
17     90  Mercury        Mountaineer                  20.430000
18     83  Mitsubishi     3000GT                       20.940000
19    106  Nissan         Xterra                       18.072975
20    112  Oldsmobile     Bravada                      19.925000
21    117  Plymouth       Prowler                      18.072975
22    123  Pontiac        Montana                      18.072975
23    126  Porsche        Carrera Cabriolet            67.550000
24    127  Saab                       5-Sep            18.072975
25    132  Saturn         LW                           18.072975
26    134  Subaru         Outback                      18.072975
27    144  Toyota         Land Cruiser                 34.080000
28    150  Volkswagen     Beetle                       18.072975
29    151  Volvo          S40                          18.072975

In [48]:
#Number of cars launched per year
#extract the year from the latest launch column and count the number of cars launched in each year
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Manufacturer         157 non-null    object
 1   Model                157 non-null    object
 2   Sales in thousands   157 non-null    float64
 3   4-year resale value  157 non-null    float64
 4   Vehicle type         157 non-null    object
 5   Price in thousands   155 non-null    float64
 6   Engine size          157 non-null    object
 7   Horsepower           156 non-null    float64
 8   Wheelbase            157 non-null    object
 9   Width                157 non-null    object
 10  Length               157 non-null    object
 11  Curb weight          157 non-null    object
 12  Fuel capacity        156 non-null    float64
 13  Fuel efficiency      154 non-null    float64
 14  Latest Launch        157 non-null    object
dtypes: float64(6), object(9)
memory usage: 18.5+ KB

In [49]:

#check from this
df['Latest Launch']=pd.to_datetime(df['Latest Launch'])
df['Latest Launch'].isnull().sum()

C:\Users\choco\AppData\Local\Temp\ipykernel_23116\1734778518.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Latest Launch']=pd.to_datetime(df['Latest Launch'])

np.int64(0)

In [50]:
df['Latest Launch'].dt.year.value_counts()

Latest Launch
2015    79
2014    75
2009     2
2008     1
Name: count, dtype: int64

In [51]:
df.groupby('Manufacturer')['Latest Launch'].count()

Manufacturer
Acura             4
Audi              3
BMW               3
Buick             4
Cadillac          5
Chevrolet         9
Chrysler          7
Dodge            11
Ford             11
Honda             5
Hyundai           3
Infiniti          1
Jaguar            1
Jeep              3
Lexus             6
Lincoln           3
Mercedes-Benz     9
Mercury           6
Mitsubishi        7
Nissan            7
Oldsmobile        6
Plymouth          4
Pontiac           6
Porsche           3
Saab              2
Saturn            5
Subaru            2
Toyota            9
Volkswagen        6
Volvo             6
Name: Latest Launch, dtype: int64